run/drone_model_study/case_top_down/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (combined);
    rho             rhoInf;
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         15;
    lRef            1.0;
    Aref            0.1;
}

// ************************************************************************* //

